package chapter10;

// == List 인터페이스 == //
// : 순서유지, 중복 저장 가능
// - 저장된 순서에 따라 데이터를 관리하는 다양한 메서드를 정의

// 1. List 특징
// - 인덱스를 통해 정확한 위치 지정
// - 중복 가능
// - 다양한 구현체를 통해 사용 가능

// 2. List 종류

// 1) ArrayList
// : 내부에서 배열을 사용한 요소 저장
// - 빠른 읽기 성능 / 느린 삽입,삭제 성능
// - 빠른 조회 기능에 적합, 삽입과 삭제 시 데이터 이동이 필요하여 상대적으로 성능 저하

// 2) LinkedList
// : 내부에서 이중 연결 리스트를 사용한 요소 저장
// - 빠른 삽입,삭제 성능 / 느린 읽기 성능
// - 연결 기반 데이터 관리: 비순차적 데이터 작업에 적합, 특정 요소 접근 시 순차 탐색이 필요하여 성능 저하

public class B_List {
	public static void main(String[] args) {
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}
}
